#include <stdio.h>
#define _USE_MATH_DEFINES
#include <math.h>
#define Pi M_PI
#include "tzap.h"
#include <assert.h>
//#define USE_DEBUG
#include "dbg_info.h"
#include "integrate.h"
#include "calc.h"

extern int v_n_t; // итератор полноты заполения двумерных массивов по координате времени
extern velocity g_c;

int test_v1()
{
	/* начальный радиус заряженной сферы в момент t=t_start */
	coordinate r0_pos = 0.1;
	coordinate r0_neg = 0.1;

	/* минимально возможный радиус заряженной сферы (из соображений упругости) в момент более ранний чем t=t_start */
	coordinate r_min_pos = 0.01;
	coordinate r_min_neg = 0.01;

	/* скорость в момент t_start*/
	velocity v0_pos = 0.0;
	velocity v0_neg = 0.0;

	/* ускорение вызванное причинами неэлектрического характера, например вледствие подвода энергии извне */
	acceleration a0_pos = 0.1*g_c;
	acceleration a0_neg = 1.0*g_c;

	mass m_pos = 10.0;
	mass m_neg = 1.0;

	/* Заряд сферы */
	charge q = 1.0;

	/* время действия ускорения вызванного причинами неэлектрического характера, например вледствие подвода энергии извне */
	double t_a0 = 1.0;

	return do_v1_calc(q, m_pos, m_neg, r0_pos, r0_neg, v0_pos, v0_neg, a0_pos, a0_neg, t_a0);
}

/*
sage: attach("copper_explosion_lw.sage")
M__Cu_sgs =  0.00140115032350105
should be 0.001401150324
a(2567) =  1.06780733067000
should be 1.067807331
c__p =  [(300, 385.000000000000), (400, 397.700000000000), (500, 408.000000000000), (600, 416.900000000000), (700, 425.100000000000), (800, 432.900000000000), (900, 441.700000000000), (1000, 451.400000000000), (1100, 464.300000000000), (1200, 480.800000000000), (1300, 506.600000000000), (1357.60000000000, 525.200000000000)]
Q__nagrev_do_T_pl =  466024.203987
should be 466024.2040
c__p(1357)=  525.001217859
should be 525.001217859185
c__p_exptrapotation=  33.3617273900798
should be 33.3617273900798
0.652969964175658
should be .6529699644
V__Cu_sgs__crit =  0.000718538627436435
should be 0.7185386277e-3
R__i =  0.000555631898340631
should be 0.5556318983e-3
Q__pl =  0.286911910827956
should be .2869119109
Q__isp =  6.71624317090642
should be 6.716243174
Q__nagrev =  4.99696901906082
should be 4.99696902105744
Q__ionization =  16.4267930476864
should be 16.42679305
V__Cu_1atm =  0.0000130035233983192
should be 0.1300352340e-4
V__Cu_450atm =  2.88967186629317e-8
should be 2.889671867*10^(-8)
V__Cu__crit =  7.18538627436435e-10
should be 7.185386277*10^(-10)
A =  12.7480190448392
should be 12.74801905
Delta_E =  93.8250638066792
should be 93.8250637789426
Delta_t =  0.000347500236321034
should be 0.347500236218306e-3
Delta_T =  127548.050829933
should be 1.27548050741264*10^5
T__e =  134641.050829933
should be 1.34641050741264*10^5
11.6024640799239
should be 11.6024640725366
7.18538627436435e-10
should be 7.185386277*10^(-10)
7.18538627436435e-10
should be 7.185386273*10^(-10)
n__i =  1.84797988858465e28
463689.588837354
should be 4.636895888*10^5
2.02023137307735e6
should be 2.02023137241212*10^6
1357.55450752652
should be 1357.554508
5914.67713054400
should be 5914.67712890453
(2.36433873744671e-12)*r__0*sqrt(T/m)
(2.41093551366813e-7)*r__0/(R_init*m*sqrt(T/m))
0.000433908766013665*r0/(m*sqrt(T/m))
should be 0.433908765869441e-3*r0/(sqrt(T/m)*m)
Compiling ./tzap.spyx...
q =  2.12744210611535 кулон
a0_pos =  3.81193295102697e-7
a0_neg =  0.000130201300422018
nr = 10000 nt = 10000
dr = 0.00000027781594917032 dt = 0.00000017375011816052
t_a0 = 0.00034750023632103418
m_pos = 0.00000141116074503615 m_neg = 0.00000000001209584880
r0_pos = 0.00027781594917031547 r0_neg = 0.00027781594917031547
v0_pos = 0.00000000000000000000 v0_neg = 0.00000000000000000000
a0_pos = 0.00000038119329510270 a0_neg = 0.00013020130042201811
sage:
*/

int copper_explosion_lw_v1()
{
	charge q = 2.12744210611535; // кулон
	power pw_pos = 0.000000001 * 270000.0/2.0;
	power pw_neg = 0.000000001 * 270000.0/2.0;
	int nr = 10000, nt = 10000;
	timespan t_a0 = 0.001 * 0.00034750023632103418;
	mass m_pos = 0.00000141116074503615, m_neg = 0.00000000001209584880;
	coordinate r0_pos = 0.00027781594917031547, r0_neg = 0.00027781594917031547;
	velocity v0_pos = 0.00000000000000000000, v0_neg = 0.00000000000000000000;
	return do_v1_calc(q, m_pos, m_neg, r0_pos, r0_neg, v0_pos, v0_neg, pw_pos, pw_neg, t_a0);
}
